[
  {
    "title": "The power of us: how we stop sexual harassment | Marianne Cooper",
    "description": "To stop sexual harassment, we must understand why it happens. In her Tedx Talk, Stanford University sociologist Marianne Cooper shares the research with us about the root causes of sexual harassment. And then, with her powerful call to action, we learn about what each of us can do to prevent harassment, hold abusers accountable, give voice to the voiceless, and work together to create long lasting change. Marianne Cooper is a sociologist studying gender and inequality at the Clayman Institute for Gender Research and the Center for Women’s Leadership at Stanford University. She is also an affiliate at the Stanford Center on Poverty and Inequality. She was the lead researcher for Lean In: Women, Work, and the Will to Lead by Sheryl Sandberg. She is a contributing writer to The Atlantic and writes about gender, leadership, diversity and inclusion, financial insecurity, and economic inequality. She is an author of the 2016, 2017, and 2018 Lean In & McKinsey Women in the Workplace reports on the status of women in corporate America. Her book, Cut Adrift: Families in Insecure Times, examines how families are coping with economic insecurity. She received her Ph.D. in sociology from the University of California, Berkeley. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
    "link": "https://www.ted.com/talks/marianne_cooper_the_power_of_us_how_we_stop_sexual_harassment?language=en"
  },
  {
    "title": "How we can end sexual harassment at work",
    "description": "When Gretchen Carlson spoke out about her experience of workplace sexual harassment, it inspired women everywhere to take their power back and tell the world what happened to them. In a remarkable, fierce talk, she tells her story -- and identifies three specific things we can all do to create safer places to work. \"We will no longer be underestimated, intimidated or set back,\" Carlson says. \"We will stand up and speak up and have our voices heard. We will be the women we were meant to be.\"",
    "link": "https://www.ted.com/talks/gretchen_carlson_how_we_can_end_sexual_harassment_at_work?language=en"
  },
  {
    "title": "Violence against women -- it's a men's issue",
    "description": "Domestic violence and sexual abuse are often called \"women's issues.\" But in this bold, blunt talk, Jackson Katz points out that these are intrinsically men's issues -- and shows how these violent behaviors are tied to definitions of manhood. A clarion call for us all -- women and men -- to call out unacceptable behavior and be leaders of change.",
    "link": "https://www.ted.com/talks/jackson_katz_violence_against_women_it_s_a_men_s_issue?language=en"
  },
  {
    "title": "The lie that invented racism",
    "description": "To understand and eradicate racist thinking, start at the beginning. That's what journalist and documentarian John Biewen did, leading to a trove of surprising and thought-provoking information on the \"origins\" of race. He shares his findings, supplying answers to fundamental questions about racism -- and lays out an exemplary path for practicing effective allyship.",
    "link": "https://www.ted.com/talks/john_biewen_the_lie_that_invented_racism"
  },
  {
    "title": "Why We Need Affirmative Action",
    "description": "Affirmative action in higher education continues to be a hotly contested policy. In her talk, Michelle details the myriad ways in which American society has systematically worked to help white Americans and oppress African Americans. Michelle goes on to argue that knowing this history will help all Americans see the necessity of affirmative action policies.",
    "link": "https://www.ted.com/talks/michelle_tlaseca_verde_why_we_need_affirmative_action"
  },
  {
    "title": "How to deconstruct racism, one headline at a time",
    "description": "Baratunde Thurston explores the phenomenon of white Americans calling the police on Black Americans who have committed the crimes of ... eating, walking or generally \"living while Black.\" In this profound, thought-provoking and often hilarious talk, he reveals the power of language to change stories of trauma into stories of healing -- while challenging us all to level up.",
    "link": "https://www.ted.com/talks/baratunde_thurston_how_to_deconstruct_racism_one_headline_at_a_time"
  },
  {
    "title": "The paradox of choice | Barry Schwartz",
    "description": "Psychologist Barry Schwartz takes aim at a central tenet of western societies: freedom of choice. In Schwartz's estimation, choice has made us not freer but more paralyzed, not happier but more dissatisfied.",
    "link": "https://www.youtube.com/watch?v=VO6XEQIsCoM&ab_channel=TED"
  },
  {
    "title": "Barry Schwartz: Our loss of wisdom",
    "description": "Barry Schwartz makes a passionate call for practical wisdom as an antidote to a society gone mad with bureaucracy. He argues powerfully that rules often fail us, incentives often backfire, and practical, everyday wisdom will help rebuild our world.",
    "link": "http://www.youtube.com/watch?v=lA-zdh_bQBo"
  },
  {
    "title": "Barry Schwartz: Using our practical wisdom",
    "description": "In an intimate talk, Barry Schwartz dives into the question \"How do we do the right thing?\" With help from collaborator Kenneth Sharpe, he shares stories that illustrate the difference between following the rules and truly choosing wisely.",
    "link": "http://www.youtube.com/watch?v=IDS-ieLCmS4"
  },
  {
    "title": "Another Top 10 Funniest Banned Commercials",
    "description": "Although they may be hilarious, for some, these commercials just went too far and as a result, were banned from TV. Luckily however, they are still available on the internet. From a dirty Doritos ad to a Game Boy Micro commercial these videos are hard to watch without laughing. \"));\n        extras.add(new ExtraItem(\"http://www.youtube.com/watch?v=Gv1fpvAqMh8\", \"Banned Commercials You Won't Be Seeing Anytime Soon\", \"Some of these ads got banned for being too risque for network TV, while others were too violent, sacrilegious, or—in the case of a truly bizarre Axe commercial—simultaneously risque and sacrilegious.",
    "link": "http://www.youtube.com/watch?v=W-Dls232Q_g"
  },
  {
    "title": "The Corporation",
    "description": "THE CORPORATION is a Canadian documentary film written by Joel Bakan, and directed by Mark Achbar and Jennifer Abbott. The documentary examines the modern-day corporation, considering its legal status as a class of person and evaluating its behavior towards society and the world at large as a psychiatrist might evaluate an ordinary person. This is explored through specific examples. Bakan wrote the book, The Corporation: The Pathological Pursuit of Profit and Power, during the filming of the documentary.",
    "link": "http://www.youtube.com/watch?v=Y888wVY5hzw"
  },
  {
    "title": "Ethical Consumption",
    "description": "Interviewees Christian Barry and Kate McDonald unwind supply chains and consider ethical consumption in a complex world.",
    "link": "https://vimeo.com/218553565"
  },
  {
    "title": "businessethicsresourcecenter.org",
    "description": "BERC, also known as the Business Ethics Resource Center, is an open-access website that makes business ethics resources available freely to the public with the intent to educate business leaders and assist them in building and maintaining strong organizational cultures and practices of ethics and compliance in the businesses and industries they serve.",
    "link": "https://www.businessethicsresourcecenter.org/"
  },
  {
    "title": "Business Ethics (YouTube Channel)",
    "description": "A Great online resource for Business Ethics.",
    "link": "https://www.youtube.com/channel/UCdIkWI_BqoiPn_OeWTVBtuw/videos"
  },
  {
    "title": "Thinking about Ethics",
    "description": "This book is a primer for college and university students of ethics, a reader for professionals negotiating moral issues and lifelong learners. It covers the most prominent ethical theories in a practical and accessible manner. Introductory chapters to Utilitarianism, Kantianism, Ethical Egoism and Virtue Ethics are followed by chapters developing arguments in favour and against.",
    "link": "https://www.goodreads.com/book/show/27606298-thinking-about-ethics?from_search=true&from_srp=true&qid=gJqkzphenc&rank=2"
  },
  {
    "title": "Human Action: A Treatise on Economics",
    "description": "Human Action: A Treatise on Economics is a work by the Austrian economist and philosopher Ludwig von Mises. Widely considered Mises' magnum opus, it presents the case for laissez-faire capitalism based on praxeology, or rational investigation of human decision-making.",
    "link": "https://www.goodreads.com/book/show/81912.Human_Action"
  },
  {
    "title": "Business Ethics (\"The Friedman Doctrine\")",
    "description": "Do business firms have any ethical or moral duties? If so, what is the scope of these moral duties? In this video the Professor will introduce and defend the so-called \"Friedman Doctrine\": the idea that the social responsibility of business is to maximize its profits.",
    "link": "https://www.youtube.com/watch?v=biEWv9O_Sk4&ab_channel=BusinessLawProf"
  },
  {
    "title": "The Importance of Business Ethics",
    "description": "Every year we seem to hear about a company involved in some sort of ethical scandal affecting workers, customers, society as a whole, or the environment.\" +\n                \"This video covers examples of ethical dilemmas, companies involved in controversial business ethics, as well as the benefits of operating a company with high ethical standards.",
    "link": "https://www.youtube.com/watch?v=pHrDUu4Rjtg&ab_channel=TheBusinessMindset"
  }
]
